app/controllers/battle_controller.rb

  def battle

    @books = Book.all
    @question_count = max_question_count_params

    count = @books.count(:id)
---
SELECT `books`.* FROM `books`
SELECT COUNT(`books`.`id`) FROM `books`