app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO `books` (`Author`, `Genre`, `CoverImage`, `Details`, `YearID`, `LevelID`, `created_at`, `updated_at`) VALUES ('TEST', 'TEST', 'TEST', 'TEST', 2, 2, '2017-04-07 15:51:28', '2017-04-07 15:51:28')

  def destroy
    @book.destroy
---
DELETE FROM `books` WHERE `books`.`id` = 56

    def set_book
      @book = Book.find(params[:id])
---
SELECT  `books`.* FROM `books` WHERE `books`.`id` = 56 LIMIT 1