app/controllers/levels_controller.rb

SELECT `levels`.* FROM `levels`
---
  def index
    @levels = Level.all