app/controllers/questions_controller.rb

  def show
    @createdBy = User.find(@question.createdBy)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def create
    @question = Question.new(question_params)

    #@question.book = Book.find(params[:BookID])
    #@question.team = Team.find(params.fetch(:TeamID))

    #render :json => params.to_json

    respond_to do |format|
      if @question.save
---
INSERT INTO `questions` (`Question`, `BookID`, `TeamID`, `createdBy`, `updatedBy`, `created_at`, `updated_at`) VALUES ('Name the book where there are two kinds of people: Reds and Silvers', 6, 2, 1, 1, '2017-04-05 22:50:47', '2017-04-05 22:50:47')

  def update
    respond_to do |format|
      if @question.update(question_params)
---
UPDATE `questions` SET `BookID` = 2, `updated_at` = '2017-04-05 23:07:25' WHERE `questions`.`id` = 1

  def destroy
    @question.destroy
---
DELETE FROM `questions` WHERE `questions`.`id` = 1

    def set_question
      @question = Question.find(params[:id])
---
SELECT  `questions`.* FROM `questions` WHERE `questions`.`id` = 1 LIMIT 1