app/controllers/roles_controller.rb

  def index
    @roles = Role.all
---
SELECT `roles`.* FROM `roles`

  def create
    @role = Role.new(role_params)

    respond_to do |format|
      if @role.save
---
INSERT INTO `roles` (`Title`, `created_at`, `updated_at`) VALUES ('Admin', '2017-03-14 15:49:03', '2017-03-14 15:49:03')

  def destroy
    @role.destroy
---
DELETE FROM `roles` WHERE `roles`.`id` = 4

    def set_role
      @role = Role.find(params[:id])
---
SELECT  `roles`.* FROM `roles` WHERE `roles`.`id` = 4 LIMIT 1