app/controllers/teams_controller.rb

  def create
    @team = Team.new(team_params)

    respond_to do |format|
      if @team.save
---
INSERT INTO `teams` (`Name`, `School`, `created_at`, `updated_at`) VALUES ('team A-1', 'school A', '2017-03-14 15:34:37', '2017-03-14 15:34:37')

  def destroy
    @team.destroy
---
DELETE FROM `teams` WHERE `teams`.`id` = 3

    def set_team
      @team = Team.find(params[:id])
---
SELECT  `teams`.* FROM `teams` WHERE `teams`.`id` = 3 LIMIT 1