app/controllers/users_controller.rb

INSERT INTO `users` (`Name`, `UserName`, `email`, `TeamID`, `RoleID`, `password`, `created_at`, `updated_at`) VALUES ('test', 'newguy', 'newguy@newmail.com', 1, 1, 'password', '2017-04-07 17:30:44', '2017-04-07 17:30:44')
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE `users` SET `Name` = 'jason', `UserName` = 'Jason Chen', `updated_at` = '2017-03-16 20:24:44' WHERE `users`.`id` = 1
---
  def update
    respond_to do |format|
      if @user.update(user_params)