app/controllers/years_controller.rb

  def index
    @years = Year.all
---
SELECT `years`.* FROM `years`

    def set_year
      @year = Year.find(params[:id])
---
SELECT  `years`.* FROM `years` WHERE `years`.`id` = 1 LIMIT 1